Oliver0804/STM32F103C8T6_FreeRtos_MPU/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2016 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"
#include "cmsis_os.h"
#include "usart.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */
#include "main.h"
#ifdef __GNUC__
  /* With GCC/RAISONANCE, small printf (option LD Linker->Libraries->Small printf
     set to 'Yes') calls __io_putchar() */
  #define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
  #define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif /* __GNUC__ */
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
	struct UART_Interface_s BlueTooth_Uart;
  struct UART_Interface_s Zigbee_Uart;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void Error_Handler(void);
void MX_FREERTOS_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
static void UART1_Write_Array(uint8_t * SendData,volatile uint16_t DataLeng);
static void UART2_Write_Array(uint8_t * SendData,volatile uint16_t DataLeng);
/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  MX_USART2_UART_Init();

  /* USER CODE BEGIN 2 */
  
  /* USER CODE END 2 */

  /* Call init function for freertos objects (in freertos.c) */
  MX_FREERTOS_Init();

  /* Start scheduler */
  osKernelStart();
  
  /* We should never get here as control is now taken by the scheduler */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

  }
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    Error_Handler();
  }

  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 15, 0);
}

/* USER CODE BEGIN 4 */

uint8_t UART_IS_IDLE(uint32_t Timeout_ms)
{
  uint32_t tickstart = 0;
  tickstart = HAL_GetTick();
  if(tickstart < Timeout_ms)
  {
    return 0;
  }
  return 1;
}

/* USART1 init function */
static void UART1_Write_Array(uint8_t * SendData,volatile uint16_t DataLeng)
{
	uint16_t LengCount = 0;
	if(DataLeng == 0)
	{
		while(*(SendData+LengCount)!=0){LengCount++;}
		while(HAL_UART_Transmit(&huart1, SendData, LengCount, (uint32_t)22000)!=HAL_OK){}
	}else
	{
		while(HAL_UART_Transmit(&huart1, SendData, DataLeng, (uint32_t)22000)!=HAL_OK){}
	}
}

/* USART2 init function */
static void UART2_Write_Array(uint8_t * SendData,volatile uint16_t DataLeng)
{
	uint16_t LengCount = 0;
	if(DataLeng == 0)
	{
		while(*(SendData+LengCount)!=0){LengCount++;}
		while(HAL_UART_Transmit(&huart2, SendData, LengCount, (uint32_t)22000)!=HAL_OK){}
	}else
	{
		while(HAL_UART_Transmit(&huart2, SendData, DataLeng, (uint32_t)22000)!=HAL_OK){}
	}
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	
	
  if(huart->Instance == USART1)
  {
    /* Set transmission flag: trasfer complete*/
    if(BlueTooth_Uart.RX_leng >= UART_RX_SIZE)
    {
      BlueTooth_Uart.RX_leng = 0;
    }
    BlueTooth_Uart.RX_Buffer[BlueTooth_Uart.RX_leng++] = BlueTooth_Uart.RX_TEMP[0];
    BlueTooth_Uart.RX_Buffer[BlueTooth_Uart.RX_leng] = 0;
    HAL_UART_Receive_IT(BlueTooth_Uart.uart_handle,&BlueTooth_Uart.RX_TEMP[0],1);
    BlueTooth_Uart.RX_Idle = HAL_GetTick() + 10;
  }
  if(huart->Instance == USART2)
  {
		//Zigbee_Uart.Sender((uint8_t*)"*",0);
    /* Set transmission flag: trasfer complete*/
    if(Zigbee_Uart.RX_leng >= UART_RX_SIZE)
    {
      Zigbee_Uart.RX_leng = 0;
    }
    Zigbee_Uart.RX_Buffer[Zigbee_Uart.RX_leng++] = Zigbee_Uart.RX_TEMP[0];
    Zigbee_Uart.RX_Buffer[Zigbee_Uart.RX_leng] = 0;
    HAL_UART_Receive_IT(Zigbee_Uart.uart_handle,&Zigbee_Uart.RX_TEMP[0],1);
    Zigbee_Uart.RX_Idle = HAL_GetTick() + 10;
  }
  
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
